### Feature Selection

In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_csv(r"/teamspace/studios/this_studio/Data-Science---Practices/data/cleaned_house_prices.csv")

In [3]:
df.head()

,Index,Title,Description,Amount in rupees,Price (in rupees),location,Carpet Area in sqft,Status,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Balcony,Ownership
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",4200000.0,6000.000000,thane,500.0,Ready to Move,10 out of 11,Resale,Unfurnished,Unknown,Unknown,1,2,Unknown
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,9800000.0,13799.000000,thane,473.0,Ready to Move,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,2,2,Freehold
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,14000000.0,17500.000000,thane,779.0,Ready to Move,10 out of 29,Resale,Unfurnished,East,Garden/Park,2,2,Freehold
3,3,1 BHK Ready to Occupy Flat for sale Kasheli,This beautiful 1 BHK Flat is available for sal...,2500000.0,7583.771885,thane,530.0,Ready to Move,1 out of 3,Resale,Unfurnished,Unknown,Unknown,1,1,Unknown
4,4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,"This lovely 2 BHK Flat in Pokhran Road, Thane ...",16000000.0,18824.000000,thane,635.0,Ready to Move,20 out of 42,Resale,Unfurnished,West,"Garden/Park, Main Road",2,2,Co-operative Society

In [4]:
df.isna().sum()

Index                     0
Title                     0
Description               0
Amount in rupees       9684
Price (in rupees)         0
location                  0
Carpet Area in sqft       0
Status                    0
Floor                     0
Transaction               0
Furnishing                0
facing                    0
overlooking               0
Bathroom                  0
Balcony                   0
Ownership                 0
dtype: int64

In [5]:
df.drop(columns=['Index','Title','Description','Status'],inplace=True)

### Label Encoding

In [6]:
from sklearn.preprocessing import LabelEncoder

# Function to perform Label Encoding for multiple columns
def label_encode_multiple(df, columns):
    le = LabelEncoder()
    for column in columns:
        df[column] = le.fit_transform(df[column])
    return df

label_encode_columns = ['location','Transaction','Floor', 'Furnishing', 'facing', 'overlooking', 'Ownership']
df = label_encode_multiple(df, label_encode_columns)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 12 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Amount in rupees     177847 non-null  float64
 1   Price (in rupees)    187531 non-null  float64
 2   location             187531 non-null  int64
 3   Carpet Area in sqft  187531 non-null  float64
 4   Floor                187531 non-null  int64
 5   Transaction          187531 non-null  int64
 6   Furnishing           187531 non-null  int64
 7   facing               187531 non-null  int64
 8   overlooking          187531 non-null  int64
 9   Bathroom             187531 non-null  int64
 10  Balcony              187531 non-null  int64
 11  Ownership            187531 non-null  int64
dtypes: float64(3), int64(9)
memory usage: 17.2 MB

In [8]:
# Fill NaN values with the mean of the column
mean_value = df['Amount in rupees'].mean()
df['Amount in rupees'].fillna(mean_value, inplace=True)

/tmp/ipykernel_60903/2720252716.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Amount in rupees'].fillna(mean_value, inplace=True)

## Standared Scaling

In [9]:
from sklearn.preprocessing import StandardScaler
# Standardization
standard_scaler = StandardScaler()
df_standardized = standard_scaler.fit_transform(df)
df = pd.DataFrame(df_standardized, columns=df.columns)

In [10]:
df.head(4)

,Amount in rupees,Price (in rupees),location,Carpet Area in sqft,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Balcony,Ownership
0,-0.202606,-6.108617e-02,1.881061,-0.333482,-1.415544,0.547069,1.076630,1.063822,1.057353,-1.653261,-0.000319,1.341873
1,-0.056796,2.397217e-01,1.881061,-0.345214,0.378898,0.547069,-0.458287,-1.146945,-1.327164,-0.492814,-0.000319,-0.743276
2,0.052560,3.824695e-01,1.881061,-0.212259,-1.352335,0.547069,1.076630,-1.146945,-1.327164,-0.492814,-0.000319,-0.743276
3,-0.246869,1.052378e-16,1.881061,-0.320448,-1.471730,0.547069,1.076630,1.063822,1.057353,-1.653261,-1.223020,1.341873

In [11]:
df.to_csv('/teamspace/studios/this_studio/Data-Science---Practices/data/final_dataset.csv', index=False)